Консолидация/src/Documents/ЗагрузкаДанныхPL/ЗагрузкаДанныхPL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаДанныхPL</name>
  <registerRecords>InformationRegister.ДанныеОтчетаPL</registerRecords>
  <registerRecords>InformationRegister.ПериодыЗагрузкиОтчетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Аналитика</types>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОтчета</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Аналитика</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиPL</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>CatalogRef.Аналитика</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Консолидация/src/InformationRegisters/ДанныеОтчетаPL/ДанныеОтчетаPL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОтчетаPL</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Аналитика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяPL</name>
    <type>
      <types>CatalogRef.СтатьиPL</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>CatalogRef.Аналитика</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Остаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Консолидация/src/Documents/ЗагрузкаДанныхPL/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияДанныеОтчетаPL = Движения.ДанныеОтчетаPL;
	ДвиженияДанныеОтчетаPL.Записывать = Истина;
	ДвиженияДанныеОтчетаPL.Очистить();
	
	ДвиженияДанныеОтчетаPL.Загрузить(ПодготовитьТаблицуДвижений_ДанныеОтчета());

КонецПроцедуры

Функция ПодготовитьТаблицуДвижений_ДанныеОтчета()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка КАК Регистратор,
		|	ЗагрузкаДанныхPLДанныеОтчета.Организация,
		|	ЗагрузкаДанныхPLДанныеОтчета.Статья КАК СтатьяPL,
		|	ЗагрузкаДанныхPLДанныеОтчета.Аналитика,
		|	ЗагрузкаДанныхPLДанныеОтчета.Период,
		|	СУММА(ЗагрузкаДанныхPLДанныеОтчета.Сумма) КАК Сумма,
		|	ЗагрузкаДанныхPLДанныеОтчета.Остаток
		|ИЗ
		|	Документ.ЗагрузкаДанныхPL.ДанныеОтчета КАК ЗагрузкаДанныхPLДанныеОтчета
		|ГДЕ
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка,
		|	ЗагрузкаДанныхPLДанныеОтчета.Организация,
		|	ЗагрузкаДанныхPLДанныеОтчета.Статья,
		|	ЗагрузкаДанныхPLДанныеОтчета.Аналитика,
		|	ЗагрузкаДанныхPLДанныеОтчета.Период,
		|	ЗагрузкаДанныхPLДанныеОтчета.Остаток";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
